/*
 * 44ANewADC.c
 *
 * Created: 22.04.2021 22:45:00
 * Author : Leo
 */ 

#include <avr/io.h>


int main(void)
{
	//Все пины порта A на вход
	DDRA=0;
	ADMUX=
	(1<<MUX0)|(0<<MUX1)|(0<<MUX2)|(0<<MUX3)|(0<<MUX4)|(0<<MUX5)|//Выбор читаемого порта
	(0<<REFS0)|(0<<REFS1);//Выбор ИОП
	
	ADCSRB=
	(0<<BIN)|(0<<ACME)|//Повторение стандартных настроек
	(1<<ADLAR)|//Ровнение справо
	(0<<ADTS0)|(0<<ADTS1)|(0<<ADTS2);//Повторение стандартных настроек
	
	ADCSRA=
	(1<<ADEN)|//разрешаем работу АЦП
	(1<<ADPS0)|(0<<ADPS1)|(1<<ADPS2)|//Устанавлиываем прескейлер
	(1<<ADATE)|//Авто-тригиринг цели АЦП
	(0<<ADIE);//Запрет прерываний
	
	//Запуск АЦП
	ADCSRA|=(1<<ADSC);
	
	DIDR0=0xff;//Выключение цифровых выходов на пинах АЦП
	
	//настройка всех портов на выход
	DDRB = 0b11111111;
	//настройка таймера
	TCCR0A = 0b10000011;
	TCCR0B = 0b00000010;
    while (1) 
    {
		OCR0A=ADCH;
    }
}

